app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
                    .where('user_id >= ?', current_user.id)
                    .where('created_at >= ?', Date.today)
---
SELECT "entries".* FROM "entries" WHERE (created_at >= '2021-01-01')

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 168772698]]

  def set_entry
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 168772698], ["LIMIT", 1]]